org/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-06 Thu 06:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike Rosset" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga2a507f">1. Installation</a>
<ul>
<li><a href="#orgf35938c">1.1. Guix</a>
<ul>
<li><a href="#orga2baf8e">1.1.1. Installing with Guix</a></li>
<li><a href="#org8dc7519">1.1.2. Developing with Git</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge8a17ab">2. Run Nomad</a>
<ul>
<li><a href="#orgb98631c">2.1. From the command line</a></li>
<li><a href="#orgabea10d">2.2. Keybinds</a></li>
</ul>
</li>
<li><a href="#orgb5a526a">3. Extend Nomad</a></li>
<li><a href="#org9a08e85">4. Build from source</a>
<ul>
<li><a href="#orgbdd23f8">4.1. Run Nomad before you've installed Nomad</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga2a507f" class="outline-2">
<h2 id="orga2a507f"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf35938c" class="outline-3">
<h3 id="orgf35938c"><span class="section-number-3">1.1</span> Guix</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orga2baf8e" class="outline-4">
<h4 id="orga2baf8e"><span class="section-number-4">1.1.1</span> Installing with Guix</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-shell">guix install nomad
</pre>
</div>
</div>
</div>
<div id="outline-container-org8dc7519" class="outline-4">
<h4 id="org8dc7519"><span class="section-number-4">1.1.2</span> Developing with Git</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="orgfce3204"></a>Clone the Nomad source repository<br />
<div class="outline-text-5" id="text-1-1-2-1">
<div class="org-src-container">
<pre class="src src-shell">git clone https://git.savannah.gnu.org/git/nomad.git
<span style="font-weight: bold;">cd</span> nomad
</pre>
</div>
</div>
</li>
<li><a id="org0332fb3"></a>Create a Nomad environment<br />
<div class="outline-text-5" id="text-1-1-2-2">
<div class="org-src-container">
<pre class="src src-shell">guix environment -L ./guix nomad-git
</pre>
</div>
</div>
</li>
<li><a id="org94d96ca"></a>Bootstrap Autotools<br />
<div class="outline-text-5" id="text-1-1-2-3">
<div class="org-src-container">
<pre class="src src-shell">./autogen.sh
</pre>
</div>
</div>
</li>
<li><a id="org5dc87ac"></a>Build and Run development Nomad<br />
<div class="outline-text-5" id="text-1-1-2-4">
<div class="org-src-container">
<pre class="src src-shell">./configure
make -j(nproc)
make run
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge8a17ab" class="outline-2">
<h2 id="orge8a17ab"><span class="section-number-2">2</span> Run Nomad</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb98631c" class="outline-3">
<h3 id="orgb98631c"><span class="section-number-3">2.1</span> From the command line</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Nomad doesn't yet support the full set of command line options. However, It
can be run from a shell by typing
</p>

<div class="org-src-container">
<pre class="src src-shell">nomad
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabea10d" class="outline-3">
<h3 id="orgabea10d"><span class="section-number-3">2.2</span> Keybinds</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Nomad intends to support Emacs-like keybinds because it's design was inspired
from Emacs. However there is no limitation on what Keybindings Nomad can
support. Nomad has the concept of key-maps just like Emacs and users should be
able to define their own keymaps.
</p>

<p>
At the top level you might want to use `M-x` (Meta/Alt X) to use the execute
command menu.
</p>

<p>
In a Webview buffer the `webview-mode-map` is active which contains the
following keybinds.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key stroke</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"C-b"</td>
<td class="org-left">(next-buffer)</td>
</tr>

<tr>
<td class="org-left">"C-u"</td>
<td class="org-left">(back)</td>
</tr>

<tr>
<td class="org-left">"C-m"</td>
<td class="org-left">(forward)</td>
</tr>

<tr>
<td class="org-left">"C-n"</td>
<td class="org-left">(scroll-down)</td>
</tr>

<tr>
<td class="org-left">"C-f"</td>
<td class="org-left">(hints)</td>
</tr>

<tr>
<td class="org-left">"C-p"</td>
<td class="org-left">(scroll-up)</td>
</tr>

<tr>
<td class="org-left">"C-r"</td>
<td class="org-left">(reload)</td>
</tr>
</tbody>
</table>

<p>
In Nomad's Ibuffer menu the `ctrl-x-map` is active which has these
keybindings.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key stroke</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"b"</td>
<td class="org-left">(next-buffer)</td>
</tr>

<tr>
<td class="org-left">"k"</td>
<td class="org-left">(kill-buffer)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb5a526a" class="outline-2">
<h2 id="orgb5a526a"><span class="section-number-2">3</span> Extend Nomad</h2>
<div class="outline-text-2" id="text-3">
<p>
You can customize nomad by writing your configurations to `~/.nomad`, which is
just a scheme file!
</p>

<p>
Examples
</p>
<div class="org-src-container">
<pre class="src src-schem">(set! search-provider-format "https://google.ca/search?q=~a")
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a08e85" class="outline-2">
<h2 id="org9a08e85"><span class="section-number-2">4</span> Build from source</h2>
<div class="outline-text-2" id="text-4">
<p>
In Ubuntu 19.04, the the following snippet will install most dependencies.
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo apt install -y <span style="font-style: italic;">\</span>
guile-2.2 <span style="font-style: italic;">\</span>
guile-2.2-dev <span style="font-style: italic;">\</span>
guile-library <span style="font-style: italic;">\</span>
libgtk-3-dev <span style="font-style: italic;">\</span>
libwebkit2gtk-4.0-dev <span style="font-style: italic;">\</span>
libgtksourceview-4-dev
</pre>
</div>

<p>
Using Guix, the following snippet will install all required
dependencies in a temporary shell.
</p>
<div class="org-src-container">
<pre class="src src-shell">guix environment -l ./guix.scm
</pre>
</div>

<p>
Then build the package with
</p>
<div class="org-src-container">
<pre class="src src-shell">autoreconf -vif
./configure
make
</pre>
</div>
</div>

<div id="outline-container-orgbdd23f8" class="outline-3">
<h3 id="orgbdd23f8"><span class="section-number-3">4.1</span> Run Nomad before you've installed Nomad</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Once you've built Nomad without errors, to run Nomad from the local build.
</p>
<div class="org-src-container">
<pre class="src src-bash">make test
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike Rosset</p>
<p class="date">Created: 2020-08-06 Thu 06:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
